### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-09-29T01:45:59Z" -> "2023-09-29T02:07:46Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-09-29T01:36:29Z" -> "2023-09-29T02:08:31Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.arpa_audit_report_to_postgres_security_group.aws_security_group.cbd[0] has changed
  ~ resource "aws_security_group" "cbd" {
      ~ egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = "Allow all egress"
+               from_port        = 0
+               ipv6_cidr_blocks = [
+                   "::/0",
                ]
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
        id                     = "sg-04836a204184dee25"
        name                   = "gost-staging-arpaauditreport-postgres--Bkcv-20230929020311423900000006"
        tags                   = {
            "Attributes" = "arpaauditreport-postgres"
            "Name"       = "gost-staging-arpaauditreport-postgres"
            "Namespace"  = "gost-staging"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.efs_data_volume.module.security_group.aws_security_group.cbd[0] has changed
  ~ resource "aws_security_group" "cbd" {
        id                     = "sg-0c612a9e9d3e9a992"
      ~ ingress                = [
+           {
+               cidr_blocks      = []
+               description      = "Allow ingress EFS traffic"
+               from_port        = 2049
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = [
+                   "sg-04836a204184dee25",
                ]
+               self             = false
+               to_port          = 2049
            },
            # (1 unchanged element hidden)
        ]
        name                   = "gost-staging-gost-staging-datavolume-20230331181050023800000001"
        tags                   = {
            "Name"      = "gost-staging-gost-staging-datavolume"
            "Namespace" = "gost-staging"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # datadog_monitor.arpa_audit_report-task_failed[0] will be updated in-place
  ~ resource "datadog_monitor" "arpa_audit_report-task_failed" {
        id                   = "132229506"
        name                 = "GOST (Draft - staging): Grant modification events failed to process"
      ~ query                = "min(last_1h):avg:aws.sqs.approximate_number_of_messages_visible{env:staging,queuename:gost-staging-dlq-20230929020311379300000004} > 0" -> (known after apply)
        tags                 = [
            "env:staging",
            "service:gost",
            "team:grants",
        ]
        # (16 unchanged attributes hidden)
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:31" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:31" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   dependsOn              = [
-                       {
-                           condition     = "START"
-                           containerName = "datadog"
                        },
                    ]
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "66344b44ed5944047d0f965e1dbb66ac39896719"
                    }
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "ARPA_AUDIT_REPORT_SQS_QUEUE_URL"
-                           value = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005"
                        },
-                       {
-                           name  = "AUDIT_REPORT_BUCKET"
-                           value = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "66344b44ed5944047d0f965e1dbb66ac39896719"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_SAVED_SEARCH_GRANTS_DIGEST"
-                           value = "true"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "PGSSLROOTCERT"
-                           value = "rds-combined-ca-bundle.pem"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://staging.grants.usdr.dev"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:latest"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-staging-api-20230217010414234200000007"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string"
                        },
                    ]
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "66344b44ed5944047d0f965e1dbb66ac39896719"
                    }
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "66344b44ed5944047d0f965e1dbb66ac39896719"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
-                   stopTimeout            = 60
-                   volumesFrom            = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 31 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_appautoscaling_policy.sqs_scale_down_ecs_tasks must be replaced
-/+ resource "aws_appautoscaling_policy" "sqs_scale_down_ecs_tasks" {
      ~ alarm_arns         = [
-           "arn:aws:cloudwatch:us-west-2:357150818708:alarm:gost-staging-SQS-ScaleDown-Tasks",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:us-west-2:357150818708:scalingPolicy:24df3478-a038-45b0-ae08-f5706fd28d86:resource/ecs/service/gost-staging/gost-staging:policyName/gost-staging-sqs-scale_down" -> (known after apply)
      ~ id                 = "gost-staging-sqs-scale_down" -> (known after apply)
      ~ name               = "gost-staging-sqs-scale_down" -> "gost-staging-arpa_audit_report-sqs-scale_down" # forces replacement
      ~ resource_id        = "service/gost-staging/gost-staging" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ step_scaling_policy_configuration {
-           cooldown                 = 0 -> null
-           min_adjustment_magnitude = 0 -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.arpa_audit_report.aws_appautoscaling_policy.sqs_scale_up_ecs_tasks must be replaced
-/+ resource "aws_appautoscaling_policy" "sqs_scale_up_ecs_tasks" {
      ~ alarm_arns         = [
-           "arn:aws:cloudwatch:us-west-2:357150818708:alarm:gost-staging-SQS-ScaleUp-Tasks",
        ] -> (known after apply)
      ~ arn                = "arn:aws:autoscaling:us-west-2:357150818708:scalingPolicy:24df3478-a038-45b0-ae08-f5706fd28d86:resource/ecs/service/gost-staging/gost-staging:policyName/gost-staging-sqs-scale_up" -> (known after apply)
      ~ id                 = "gost-staging-sqs-scale_up" -> (known after apply)
      ~ name               = "gost-staging-sqs-scale_up" -> "gost-staging-arpa_audit_report-sqs-scale_up" # forces replacement
      ~ resource_id        = "service/gost-staging/gost-staging" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)

      ~ step_scaling_policy_configuration {
-           min_adjustment_magnitude = 0 -> null
            # (3 unchanged attributes hidden)

            # (7 unchanged blocks hidden)
        }
    }

  # module.arpa_audit_report.aws_appautoscaling_target.desired_count must be replaced
-/+ resource "aws_appautoscaling_target" "desired_count" {
      ~ arn                = "arn:aws:application-autoscaling:us-west-2:357150818708:scalable-target/0ec524df3478a03845b0ae08f5706fd28d86" -> (known after apply)
      ~ id                 = "service/gost-staging/gost-staging" -> (known after apply)
      ~ resource_id        = "service/gost-staging/gost-staging" -> "service/gost-staging/gost-staging-arpa_audit_report" # forces replacement
      ~ role_arn           = "arn:aws:iam::357150818708:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> (known after apply)
-       tags               = {} -> null
        # (5 unchanged attributes hidden)
    }

  # module.arpa_audit_report.aws_cloudwatch_log_group.default must be replaced
+/- resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003" -> (known after apply)
      ~ id                = "gost-staging-20230929020311378500000003" -> (known after apply)
      ~ name              = "gost-staging-20230929020311378500000003" -> (known after apply)
      ~ name_prefix       = "gost-staging-" -> "gost-staging-arpa_audit_report-" # forces replacement
-       tags              = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.arpa_audit_report.aws_cloudwatch_metric_alarm.sqs-scale_down_tasks must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "sqs-scale_down_tasks" {
      ~ alarm_actions                         = [
-           "arn:aws:autoscaling:us-west-2:357150818708:scalingPolicy:24df3478-a038-45b0-ae08-f5706fd28d86:resource/ecs/service/gost-staging/gost-staging:policyName/gost-staging-sqs-scale_down",
        ] -> (known after apply)
      ~ alarm_name                            = "gost-staging-SQS-ScaleDown-Tasks" -> "gost-staging-arpa_audit_report-SQS-ScaleDown-Tasks" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-west-2:357150818708:alarm:gost-staging-SQS-ScaleDown-Tasks" -> (known after apply)
-       datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
-           "QueueName" = "gost-staging-20230929020311387800000005"
        } -> (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "gost-staging-SQS-ScaleDown-Tasks" -> (known after apply)
-       insufficient_data_actions             = [] -> null
-       ok_actions                            = [] -> null
-       tags                                  = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.arpa_audit_report.aws_cloudwatch_metric_alarm.sqs_scale_up_ecs_tasks must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "sqs_scale_up_ecs_tasks" {
      ~ alarm_actions                         = [
-           "arn:aws:autoscaling:us-west-2:357150818708:scalingPolicy:24df3478-a038-45b0-ae08-f5706fd28d86:resource/ecs/service/gost-staging/gost-staging:policyName/gost-staging-sqs-scale_up",
        ] -> (known after apply)
      ~ alarm_name                            = "gost-staging-SQS-ScaleUp-Tasks" -> "gost-staging-arpa_audit_report-SQS-ScaleUp-Tasks" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:us-west-2:357150818708:alarm:gost-staging-SQS-ScaleUp-Tasks" -> (known after apply)
-       datapoints_to_alarm                   = 0 -> null
      ~ dimensions                            = {
-           "QueueName" = "gost-staging-20230929020311387800000005"
        } -> (known after apply)
+       evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "gost-staging-SQS-ScaleUp-Tasks" -> (known after apply)
-       insufficient_data_actions             = [] -> null
-       ok_actions                            = [] -> null
-       tags                                  = {} -> null
        # (11 unchanged attributes hidden)
    }

  # module.arpa_audit_report.aws_ecs_service.default must be replaced
-/+ resource "aws_ecs_service" "default" {
-       health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging" -> (known after apply)
      ~ name                               = "gost-staging" -> "gost-staging-arpa_audit_report" # forces replacement
      ~ platform_version                   = "LATEST" -> (known after apply)
-       propagate_tags                     = "NONE" -> null
-       tags                               = {} -> null
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging:1" -> (known after apply)
      ~ triggers                           = {} -> (known after apply)
        # (10 unchanged attributes hidden)

-       deployment_circuit_breaker {
-           enable   = false -> null
-           rollback = false -> null
        }

-       deployment_controller {
-           type = "ECS" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer must be replaced
+/- resource "aws_ecs_task_definition" "consumer" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging" -> (known after apply)
      ~ container_definitions    = (sensitive value) -> (sensitive value) # forces replacement
      ~ execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-ECSExec-20230929020311455100000007" -> (known after apply) # forces replacement
      ~ family                   = "gost-staging" -> "gost-staging-arpa_audit_report" # forces replacement
      ~ id                       = "gost-staging" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 1 -> (known after apply)
-       tags                     = {} -> null
      ~ task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.aws_iam_role.execution must be replaced
+/- resource "aws_iam_role" "execution" {
      ~ arn                   = "arn:aws:iam::357150818708:role/gost-staging-ECSExec-20230929020311455100000007" -> (known after apply)
      ~ create_date           = "2023-09-29T02:03:11Z" -> (known after apply)
      ~ id                    = "gost-staging-ECSExec-20230929020311455100000007" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "gost-staging-ECSExec-20230929020311455100000007" -> (known after apply)
      ~ name_prefix           = "gost-staging-ECSExec-" -> "gost-staging-arpa_audit_report-Exec-" # forces replacement
      ~ role_last_used        = [
-           {
-               last_used_date = ""
-               region         = ""
            },
        ] -> (known after apply)
-       tags                  = {} -> null
      ~ unique_id             = "AROAVGJ6ZAGKO6F2IF5FW" -> (known after apply)
        # (6 unchanged attributes hidden)

-       inline_policy {
-           name   = "decrypt-datadog-api-key" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = "kms:Decrypt"
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
-                               "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
                            ]
-                           Sid      = "DecryptWithKMS"
                        },
-                       {
-                           Action   = [
-                               "ssm:GetParameters",
-                               "secretsmanager:GetSecretValue",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
-                           Sid      = "GetSecretParameters"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "write-logs" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "logs:PutLogEvents",
-                               "logs:DescribeLogStreams",
-                               "logs:CreateLogStream",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003:log-stream:*",
-                               "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003",
                            ]
-                           Sid      = "WriteLogs"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.arpa_audit_report.aws_iam_role.task must be replaced
+/- resource "aws_iam_role" "task" {
      ~ arn                   = "arn:aws:iam::357150818708:role/gost-staging-ECSTask-20230929020311471700000008" -> (known after apply)
      ~ create_date           = "2023-09-29T02:03:11Z" -> (known after apply)
      ~ id                    = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply)
      ~ name_prefix           = "gost-staging-ECSTask-" -> "gost-staging-arpa_audit_report-Task-" # forces replacement
      ~ role_last_used        = [
-           {
-               last_used_date = ""
-               region         = ""
            },
        ] -> (known after apply)
-       tags                  = {} -> null
      ~ unique_id             = "AROAVGJ6ZAGKCFB3YIDDG" -> (known after apply)
        # (6 unchanged attributes hidden)

-       inline_policy {
-           name   = "connect-to-postgres" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = "rds-db:connect"
-                           Effect   = "Allow"
-                           Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
-                           Sid      = "DBAccess"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "consume-sqs-messages" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "sqs:ReceiveMessage",
-                               "sqs:DeleteMessage",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                           Sid      = "AllowConsumeMessages"
                        },
-                       {
-                           Action   = [
-                               "sqs:GetQueueUrl",
-                               "sqs:GetQueueAttributes",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                           Sid      = "AllowReadMetadata"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "ecs-exec" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "ssmmessages:OpenDataChannel",
-                               "ssmmessages:OpenControlChannel",
-                               "ssmmessages:CreateDataChannel",
-                               "ssmmessages:CreateControlChannel",
                            ]
-                           Effect   = "Allow"
-                           Resource = "*"
-                           Sid      = "AllowExec"
                        },
-                       {
-                           Action   = "logs:DescribeLogGroups"
-                           Effect   = "Allow"
-                           Resource = "*"
-                           Sid      = "InventoryLogGroupsForExec"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "rw-audit-reports-bucket" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "s3:PutObject",
-                               "s3:GetObject",
                            ]
-                           Effect   = "Allow"
-                           Resource = "arn:aws:s3:::gost-staging-arpaauditreports-357150818708-us-west-2-api/*"
-                           Sid      = "ReadWriteBucketObjects"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
-       inline_policy {
-           name   = "write-logs" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = [
-                               "logs:PutLogEvents",
-                               "logs:DescribeLogStreams",
-                               "logs:CreateLogStream",
                            ]
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003:log-stream:*",
-                               "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003",
                            ]
-                           Sid      = "WriteLogs"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.arpa_audit_report.aws_iam_role_policy.execution["decrypt-datadog-api-key"] must be replaced
-/+ resource "aws_iam_role_policy" "execution" {
      ~ id     = "gost-staging-ECSExec-20230929020311455100000007:decrypt-datadog-api-key" -> (known after apply)
        name   = "decrypt-datadog-api-key"
      ~ role   = "gost-staging-ECSExec-20230929020311455100000007" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.arpa_audit_report.aws_iam_role_policy.execution["write-logs"] must be replaced
-/+ resource "aws_iam_role_policy" "execution" {
      ~ id     = "gost-staging-ECSExec-20230929020311455100000007:write-logs" -> (known after apply)
        name   = "write-logs"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:DescribeLogStreams",
-                           "logs:CreateLogStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003:log-stream:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003",
                        ]
-                       Sid      = "WriteLogs"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role   = "gost-staging-ECSExec-20230929020311455100000007" -> (known after apply) # forces replacement
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["connect-to-postgres"] must be replaced
-/+ resource "aws_iam_role_policy" "task" {
      ~ id     = "gost-staging-ECSTask-20230929020311471700000008:connect-to-postgres" -> (known after apply)
        name   = "connect-to-postgres"
      ~ role   = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["consume-sqs-messages"] must be replaced
-/+ resource "aws_iam_role_policy" "task" {
      ~ id     = "gost-staging-ECSTask-20230929020311471700000008:consume-sqs-messages" -> (known after apply)
        name   = "consume-sqs-messages"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "sqs:ReceiveMessage",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                       Sid      = "AllowConsumeMessages"
                    },
-                   {
-                       Action   = [
-                           "sqs:GetQueueUrl",
-                           "sqs:GetQueueAttributes",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                       Sid      = "AllowReadMetadata"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role   = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["ecs-exec"] must be replaced
-/+ resource "aws_iam_role_policy" "task" {
      ~ id     = "gost-staging-ECSTask-20230929020311471700000008:ecs-exec" -> (known after apply)
        name   = "ecs-exec"
      ~ role   = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["rw-audit-reports-bucket"] must be replaced
-/+ resource "aws_iam_role_policy" "task" {
      ~ id     = "gost-staging-ECSTask-20230929020311471700000008:rw-audit-reports-bucket" -> (known after apply)
        name   = "rw-audit-reports-bucket"
      ~ role   = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.arpa_audit_report.aws_iam_role_policy.task["write-logs"] must be replaced
-/+ resource "aws_iam_role_policy" "task" {
      ~ id     = "gost-staging-ECSTask-20230929020311471700000008:write-logs" -> (known after apply)
        name   = "write-logs"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:DescribeLogStreams",
-                           "logs:CreateLogStream",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003:log-stream:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:gost-staging-20230929020311378500000003",
                        ]
-                       Sid      = "WriteLogs"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ role   = "gost-staging-ECSTask-20230929020311471700000008" -> (known after apply) # forces replacement
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:16" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 16 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.arpa_audit_report.module.consume_sqs_messages_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowConsumeMessages"
        }
+       statement {
+           actions   = [
+               "sqs:GetQueueAttributes",
+               "sqs:GetQueueUrl",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowReadMetadata"
        }
    }

  # module.arpa_audit_report.module.sqs_queue.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "sqs:SendMessage",
+               "sqs:SendMessageBatch",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
+           sid       = "AllowPublishMessages"

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api",
                ]
+               variable = "aws:SourceArn"
            }

+           principals {
+               identifiers = [
+                   "ecs-tasks.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue.dlq[0] must be replaced
-/+ resource "aws_sqs_queue" "dlq" {
      ~ arn                               = "arn:aws:sqs:us-west-2:357150818708:gost-staging-dlq-20230929020311379300000004" -> (known after apply)
+       deduplication_scope               = (known after apply)
+       fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-dlq-20230929020311379300000004" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "gost-staging-dlq-20230929020311379300000004" -> (known after apply)
      ~ name_prefix                       = "gost-staging-dlq-" -> "gost-staging-arpa_audit_report-dlq-" # forces replacement
+       policy                            = (known after apply)
      ~ redrive_allow_policy              = jsonencode(
            {
-               redrivePermission = "byQueue"
-               sourceQueueArns   = [
-                   "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005",
                ]
            }
        ) -> (known after apply)
+       redrive_policy                    = (known after apply)
-       tags                              = {} -> null
      ~ url                               = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-dlq-20230929020311379300000004" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue.this[0] must be replaced
+/- resource "aws_sqs_queue" "this" {
      ~ arn                               = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005" -> (known after apply)
+       deduplication_scope               = (known after apply)
+       fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "gost-staging-20230929020311387800000005" -> (known after apply)
      ~ name_prefix                       = "gost-staging-" -> "gost-staging-arpa_audit_report-" # forces replacement
      ~ policy                            = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "sqs:SendMessageBatch",
-                           "sqs:SendMessage",
                        ]
-                       Condition = {
-                           ArnEquals = {
-                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ecs-tasks.amazonaws.com"
                        }
-                       Resource  = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                       Sid       = "AllowPublishMessages"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
+       redrive_allow_policy              = (known after apply)
      ~ redrive_policy                    = jsonencode(
            {
-               deadLetterTargetArn = "arn:aws:sqs:us-west-2:357150818708:gost-staging-dlq-20230929020311379300000004"
-               maxReceiveCount     = 2
            }
        ) -> (known after apply)
-       tags                              = {} -> null
      ~ url                               = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_policy.this[0] must be replaced
-/+ resource "aws_sqs_queue_policy" "this" {
      ~ id        = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply)
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = [
-                           "sqs:SendMessageBatch",
-                           "sqs:SendMessage",
                        ]
-                       Condition = {
-                           ArnEquals = {
-                               "aws:SourceArn" = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "ecs-tasks.amazonaws.com"
                        }
-                       Resource  = "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005"
-                       Sid       = "AllowPublishMessages"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ queue_url = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply) # forces replacement
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_redrive_allow_policy.dlq[0] must be replaced
-/+ resource "aws_sqs_queue_redrive_allow_policy" "dlq" {
      ~ id                   = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-dlq-20230929020311379300000004" -> (known after apply)
      ~ queue_url            = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-dlq-20230929020311379300000004" -> (known after apply) # forces replacement
      ~ redrive_allow_policy = jsonencode(
            {
-               redrivePermission = "byQueue"
-               sourceQueueArns   = [
-                   "arn:aws:sqs:us-west-2:357150818708:gost-staging-20230929020311387800000005",
                ]
            }
        ) -> (known after apply)
    }

  # module.arpa_audit_report.module.sqs_queue.aws_sqs_queue_redrive_policy.dlq[0] must be replaced
-/+ resource "aws_sqs_queue_redrive_policy" "dlq" {
      ~ id             = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply)
      ~ queue_url      = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-20230929020311387800000005" -> (known after apply) # forces replacement
      ~ redrive_policy = jsonencode(
            {
-               deadLetterTargetArn = "arn:aws:sqs:us-west-2:357150818708:gost-staging-dlq-20230929020311379300000004"
-               maxReceiveCount     = 2
            }
        ) -> (known after apply)
    }

  # module.arpa_audit_report.module.write_logs_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:DescribeLogStreams",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

Plan: 24 to add, 3 to change, 24 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*